In [2]:
import pandas as pd
import numpy as np
data = {
    'Visitor_ID': [f'V{1000 + i}' for i in range(20)],
    'Name': ['ABHISHEK SANDEEP      ZADE     ', 'ARNAV AJAY DESHPANDE.. ', '.. .. ASHWINI LALCHAND MUNDAWARE/ ', 'GAYATRI SURESH GAIKWAD', 'HARSHADA GANESH CHAUDHARI',
             'VAIBHAVI HARISHWAR PATIL', np.nan, 'VISHAKHA PUNDLIK JADHAV', 'YASH BHARAT SOLUNKE/', 'VIVEK SANTOSH KHANDWE',
             'VISHAKHA PUNDLIK JADHAV', 'Tanushree chhanwal', 'Shruti jaiswal', 'Shriyash Sulakhe', 'YASH BHARAT SOLUNKE',
             np.nan, 'ARNAV AJAY DESHPANDE', 'RUTUJA SANTOSH THOTE', 'ROHIT DILIP BILWAL', 'RITESH SHIVAJI BAIRAGI'],
    'Age': [25, 23, 22, np.nan, 21, 25, 24, 24, 28, np.nan,
            22, 23, 25, 27, 25, 30, 31, 26, 19, 19],
    'Ticket_Price': [500, 750, 500, 1000, np.nan, 500, 700, 650, 750, 1000,
                      500, 800, np.nan, 750, 500, 700, 900, 850, 750, np.nan],
    'Check_In_Time': ['10:00 AM', '10:30 AM', '11:00 AM', '11:30 AM', np.nan,
                       '10:00 AM', '12:00 PM', '12:30 PM', '01:00 PM', '01:30 PM',
                       '11:00 AM', '02:00 PM', np.nan, '02:30 PM', '10:00 AM',
                       '12:00 PM', '03:00 PM', '03:30 PM', '04:00 PM', np.nan],
    'City':['Delhi','Aurangabad', 'Mumbai','Bombay','New Delhi','NDL','Chennai','Chenai','Chennaai','Bangalore',
            'Delhi','Pune', 'New Delhi','Bombay','New Delhi','NDL','Indore','Bangalore','Ujjain','Bangalore'],
    'State': ['Delhi','Maharastra', 'Maharastra','Maharastra','Delhi','Delhi','Tamilnadu','Tamilnadu','Tamilnadu','Karnataka',
            'Delhi','Maharastra', 'Delhi','Maharastra','Delhi','Delhi','Madhya Pradesh','Karnataka','Madhya Pradesh','Karnataka']
}

In [12]:
df = pd.DataFrame(data)
df.head(1)

,Visitor_ID,Name,Age,Ticket_Price,Check_In_Time,City,State
0,V1000,ABHISHEK SANDEEP ZADE,25.0,500.0,10:00 AM,Delhi,Delhi

In [14]:
df.shape

(20, 7)

In [15]:
df.info

<bound method DataFrame.info of    Visitor_ID                                Name   Age  Ticket_Price  \
0       V1000     ABHISHEK SANDEEP      ZADE       25.0         500.0
1       V1001             ARNAV AJAY DESHPANDE..   23.0         750.0
2       V1002  .. .. ASHWINI LALCHAND MUNDAWARE/   22.0         500.0
3       V1003              GAYATRI SURESH GAIKWAD   NaN        1000.0
4       V1004           HARSHADA GANESH CHAUDHARI  21.0           NaN
5       V1005            VAIBHAVI HARISHWAR PATIL  25.0         500.0
6       V1006                                 NaN  24.0         700.0
7       V1007             VISHAKHA PUNDLIK JADHAV  24.0         650.0
8       V1008                YASH BHARAT SOLUNKE/  28.0         750.0
9       V1009               VIVEK SANTOSH KHANDWE   NaN        1000.0
10      V1010             VISHAKHA PUNDLIK JADHAV  22.0         500.0
11      V1011                  Tanushree chhanwal  23.0         800.0
12      V1012                      Shruti jaiswal  25.0           NaN
13      V1013                    Shriyash Sulakhe  27.0         750.0
14      V1014                 YASH BHARAT SOLUNKE  25.0         500.0
15      V1015                                 NaN  30.0         700.0
16      V1016                ARNAV AJAY DESHPANDE  31.0         900.0
17      V1017                RUTUJA SANTOSH THOTE  26.0         850.0
18      V1018                  ROHIT DILIP BILWAL  19.0         750.0
19      V1019              RITESH SHIVAJI BAIRAGI  19.0           NaN

   Check_In_Time        City           State
0       10:00 AM       Delhi           Delhi
1       10:30 AM  Aurangabad      Maharastra
2       11:00 AM      Mumbai      Maharastra
3       11:30 AM      Bombay      Maharastra
4            NaN   New Delhi           Delhi
5       10:00 AM         NDL           Delhi
6       12:00 PM     Chennai       Tamilnadu
7       12:30 PM      Chenai       Tamilnadu
8       01:00 PM    Chennaai       Tamilnadu
9       01:30 PM   Bangalore       Karnataka
10      11:00 AM       Delhi           Delhi
11      02:00 PM        Pune      Maharastra
12           NaN   New Delhi           Delhi
13      02:30 PM      Bombay      Maharastra
14      10:00 AM   New Delhi           Delhi
15      12:00 PM         NDL           Delhi
16      03:00 PM      Indore  Madhya Pradesh
17      03:30 PM   Bangalore       Karnataka
18      04:00 PM      Ujjain  Madhya Pradesh
19           NaN   Bangalore       Karnataka  >

In [4]:

df=pd.DataFrame(data)
print(df.head())


print(df.tail(2))

Top 5 rows:
  Visitor_ID                                Name   Age  Ticket_Price  \
0      V1000     ABHISHEK SANDEEP      ZADE       25.0         500.0
1      V1001             ARNAV AJAY DESHPANDE..   23.0         750.0
2      V1002  .. .. ASHWINI LALCHAND MUNDAWARE/   22.0         500.0
3      V1003              GAYATRI SURESH GAIKWAD   NaN        1000.0
4      V1004           HARSHADA GANESH CHAUDHARI  21.0           NaN

  Check_In_Time        City       State
0      10:00 AM       Delhi       Delhi
1      10:30 AM  Aurangabad  Maharastra
2      11:00 AM      Mumbai  Maharastra
3      11:30 AM      Bombay  Maharastra
4           NaN   New Delhi       Delhi

Last 2 rows:
   Visitor_ID                    Name   Age  Ticket_Price Check_In_Time  \
18      V1018      ROHIT DILIP BILWAL  19.0         750.0      04:00 PM
19      V1019  RITESH SHIVAJI BAIRAGI  19.0           NaN           NaN

         City           State
18     Ujjain  Madhya Pradesh
19  Bangalore       Karnataka

In [5]:
df.dtypes

Visitor_ID        object
Name              object
Age              float64
Ticket_Price     float64
Check_In_Time     object
City              object
State             object
dtype: object

In [6]:
df.describe()

             Age  Ticket_Price
count  18.000000     17.000000
mean   24.388889    711.764706
std     3.292396    170.045409
min    19.000000    500.000000
25%    22.250000    500.000000
50%    24.500000    750.000000
75%    25.750000    800.000000
max    31.000000   1000.000000

In [7]:
df.describe(include='all')

,Visitor_ID,Name,Age,Ticket_Price,Check_In_Time,City,State
count,20,18,18.000000,17.000000,17,20,20
unique,20,17,NaN,NaN,13,13,5
top,V1000,VISHAKHA PUNDLIK JADHAV,NaN,NaN,10:00 AM,New Delhi,Delhi
freq,1,2,NaN,NaN,3,3,7
mean,NaN,NaN,24.388889,711.764706,NaN,NaN,NaN
std,NaN,NaN,3.292396,170.045409,NaN,NaN,NaN
min,NaN,NaN,19.000000,500.000000,NaN,NaN,NaN
25%,NaN,NaN,22.250000,500.000000,NaN,NaN,NaN
50%,NaN,NaN,24.500000,750.000000,NaN,NaN,NaN
75%,NaN,NaN,25.750000,800.000000,NaN,NaN,NaN
max,NaN,NaN,31.000000,1000.000000,NaN,NaN,NaN

In [8]:
import re

In [13]:
df = df.drop_duplicates()

In [14]:
print(df)

   Visitor_ID                             Name   Age  Ticket_Price  \
0       V1000  ABHISHEK SANDEEP      ZADE       25.0         500.0
1       V1001            ARNAV AJAY DESHPANDE   23.0         750.0
2       V1002      ASHWINI LALCHAND MUNDAWARE   22.0         500.0
3       V1003           GAYATRI SURESH GAIKWAD   NaN        1000.0
4       V1004        HARSHADA GANESH CHAUDHARI  21.0           NaN
5       V1005         VAIBHAVI HARISHWAR PATIL  25.0         500.0
6       V1006                              NaN  24.0         700.0
7       V1007          VISHAKHA PUNDLIK JADHAV  24.0         650.0
8       V1008              YASH BHARAT SOLUNKE  28.0         750.0
9       V1009            VIVEK SANTOSH KHANDWE   NaN        1000.0
10      V1010          VISHAKHA PUNDLIK JADHAV  22.0         500.0
11      V1011               Tanushree chhanwal  23.0         800.0
12      V1012                   Shruti jaiswal  25.0           NaN
13      V1013                 Shriyash Sulakhe  27.0         750.0
14      V1014              YASH BHARAT SOLUNKE  25.0         500.0
15      V1015                              NaN  30.0         700.0
16      V1016             ARNAV AJAY DESHPANDE  31.0         900.0
17      V1017             RUTUJA SANTOSH THOTE  26.0         850.0
18      V1018               ROHIT DILIP BILWAL  19.0         750.0
19      V1019           RITESH SHIVAJI BAIRAGI  19.0           NaN

   Check_In_Time        City           State
0        1000 AM       Delhi           Delhi
1        1030 AM  Aurangabad      Maharastra
2        1100 AM      Mumbai      Maharastra
3        1130 AM      Bombay      Maharastra
4            NaN   New Delhi           Delhi
5        1000 AM         NDL           Delhi
6        1200 PM     Chennai       Tamilnadu
7        1230 PM      Chenai       Tamilnadu
8        0100 PM    Chennaai       Tamilnadu
9        0130 PM   Bangalore       Karnataka
10       1100 AM       Delhi           Delhi
11       0200 PM        Pune      Maharastra
12           NaN   New Delhi           Delhi
13       0230 PM      Bombay      Maharastra
14       1000 AM   New Delhi           Delhi
15       1200 PM         NDL           Delhi
16       0300 PM      Indore  Madhya Pradesh
17       0330 PM   Bangalore       Karnataka
18       0400 PM      Ujjain  Madhya Pradesh
19           NaN   Bangalore       Karnataka